Repository: mohuganda/safe_mama_mobile_flutter
Catalog: lib/l10n/app_*.arb
Languages: sw

source: Login
sw: Ingia

source: Login Now
sw: Ingia sasa

source: Register
sw: Jisajili

source: Register Now
sw: Jisajili sasa

source: Password
sw: Nywila

source: Confirm Password
sw: Thibitisha nywila

source: Knowledge Hubs Portals
sw: Vituo vya Maarifa

source: My Profile
sw: Wasifu wangu

source: My Publications
sw: Machapisho yangu

source: My Favorites
sw: Vipendwa vyangu

source: Content Request
sw: Ombi la maudhui

source: Notifications
sw: Arifa

source: Change Language
sw: Badilisha lugha

source: FAQs
sw: Maswali yanayoulizwa mara kwa mara

source: Privacy Policy
sw: Sera ya faragha

source: Settings
sw: Mipangilio

source: Success
sw: Mafanikio

source: Update
sw: Sasisha

source: Updating...
sw: Inasasisha...

source: Something went wrong
sw: Kuna hitilafu fulani

source: Profile updated successfully
sw: Wasifu umesasishwa kwa mafanikio

source: Choose Preferences
sw: Chagua mapendeleo

source: Choose Country
sw: Chagua nchi

source: Choose Community
sw: Chagua jamii

source: Preferences
sw: Mapendeleo

source: First Name
sw: Jina la kwanza

source: Last Name
sw: Jina la familia

source: Username
sw: Jina la mtumiaji

source: Phone Number
sw: Namba ya simu

source: Country
sw: Nchi

source: Email
sw: Barua pepe

source: Title
sw: Kichwa

source: Job
sw: Kazi

source: Language
sw: Lugha

source: Save
sw: Hifadhi

source: Cancel
sw: Ghairi

source: Profile Picture
sw: Picha ya wasifu

source: Logout
sw: Toka

source: You need to be logged in to view your profile.
sw: Unahitaji kuingia ili kuona wasifu wako.

source: You need to be logged in to view your favorites.
sw: Unahitaji kuingia ili kuona vipendwa vyako.

source: You need to be logged in to view your publications.
sw: Unahitaji kuingia ili kuona machapisho yako.

source: You need to be logged in for you to create a new publication.
sw: Unahitaji kuingia ili kuunda chapisho jipya.

# loginConfirmationText
source: Login Confirmation
sw: Uthibitisho wa kuingia

source: Are you sure you want to log out?
sw: Je, una uhakika unataka kutoka?

source: New Publication
sw: Chapisho jipya

source: Themes
sw: Mandhari

source: Select a public health theme
sw: Chagua mandhari ya afya ya umma

source: Search
sw: Tafuta

source: Recommended
sw: Pendekezo

# moreDotted
source: More...
sw: Zaidi...

source: Resource Categories
sw: Aina za rasilimali

source: Top Searches
sw: Utafutaji maarufu

source: Home
sw: Nyumbani

source: Forums
sw: Majukwaa

source: Communities
sw: Jamii

source: Learning
sw: Kujifunza

source: AI Compare Publications
sw: Linganisha machapisho kwa AI

source: Compare
sw: Linganisha

source: Comparing...
sw: Inalinganisha...

source: This may take a little while.
sw: Hii inaweza kuchukua muda kidogo.

source: Click the button below to compare
sw: Bonyeza kitufe hapa chini ili kulinganisha

source: No publications found
sw: Hakuna machapisho yaliyopatikana

source: Comparing publications...
sw: Inalinganisha machapisho...

source: Hide Additional Instructions
sw: Ficha maelekezo ya ziada

source: Add Additional Instructions
sw: Ongeza maelekezo ya ziada

source: Additional Instructions
sw: Maelekezo ya ziada

source: Please select two publications to compare
sw: Tafadhali chagua machapisho mawili ya kulinganisha

source: Content copied to clipboard
sw: Maudhui yamenakiliwa kwenye ubao wa kunakili

source: Share
sw: Shiriki

source: Copy
sw: Nakili

source: AI Summarizer
sw: Muhtasari wa AI

source: Summarizing content...
sw: Inafanya muhtasari wa maudhui...

# clickButtonBelowToSummarize
source: Click the button below to summarize
sw: Bonyeza kitufe hapa chini ili kufanya muhtasari

source: Summarize
sw: Fanya muhtasari

source: Summarizing...
sw: Inafanya muhtasari...

# enterTheEmailAddressAssociatedWithYourAccount
source: Enter the email address associated with your account and we will send you a link to reset your password.
sw: Ingiza anwani ya barua pepe inayohusiana na akaunti yako na tutakutumia kiungo cha kuweka upya nywila yako.

source: Enter email address
sw: Ingiza anwani ya barua pepe

source: Forgot Password
sw: Umesahau nywila

source: Send Reset Link
sw: Tuma kiungo cha kuweka upya

# weHaveSentYouALinkToResetYourPassword
source: We have sent you a link to reset your password. Please check your email.
sw: Tumekutumia kiungo cha kuweka upya nywila yako. Tafadhali angalia barua pepe yako.

source: Job Title
sw: Cheo cha kazi

# acceptTermsAndConditions
source: By registering your details, you agree with our Terms & Conditions, and Privacy and Cookie Policy.
sw: Kwa kusajili maelezo yako, unakubali Masharti na Masharti yetu, na Sera ya Faragha na Vidakuzi.

# agreeToTermsAndConditions
source: Agree to our terms and conditions
sw: Nakubali masharti na masharti

source: Passwords do not match
sw: Nywila hazifanani

source: Please select at least one preference
sw: Tafadhali chagua angalau pendeleo moja

source: Please select a country
sw: Tafadhali chagua nchi

source: Please select a job title
sw: Tafadhali chagua cheo cha kazi

# accountCreatedSuccessfully
source: Your account has been successfully created. Please check your email for the verification link.
sw: Akaunti yako imeundwa kwa mafanikio. Tafadhali angalia barua pepe yako kwa kiungo cha uthibitishaji.

# submitAContentRequest
source: Submit a new content request!
sw: Wasilisha ombi jipya la maudhui!

source: Subject
sw: Mada

source: Details
sw: Maelezo

source: Add details
sw: Ongeza maelezo

# contentRequestSubmittedSuccessfully
source: Your content request has been submitted successfully!
sw: Ombi lako la maudhui limewasilishwa kwa mafanikio!

source: Course Detail
sw: Maelezo ya kozi

source: Read Less
sw: Soma kidogo

source: Read More
sw: Soma zaidi

source: Got to Course
sw: Nenda kwenye kozi

source: Courses
sw: Kozi

source: About Event
sw: Kuhusu tukio

source: Organizer
sw: Mpangaji

source: Event Fee
sw: Ada ya tukio

source: View Event
sw: Tazama tukio

source: New Discussion
sw: Mjadala mpya

# startNewDiscussion
source: Start a new discussion, interested individuals will be alert and will join you!
sw: Anza mjadala mpya, watu wenye nia wataarifiwa na watajiunga nawe!

source: Forum Title
sw: Kichwa cha jukwaa

source: Forum Image
sw: Picha ya jukwaa

source: Add image
sw: Ongeza picha

source: Forum Story
sw: Hadithi ya jukwaa

source: Add forum image
sw: Ongeza picha ya jukwaa

source: Add forum story
sw: Ongeza hadithi ya jukwaa

# forumDiscussionSubmittedSuccessfully
source: Your forum discussion has been submitted successfully!
sw: Mjadala wako wa jukwaa umewasilishwa kwa mafanikio!

source: Forum Detail
sw: Maelezo ya jukwaa

source: Pending Approval
sw: Inasubiri idhini

source: Enter comment
sw: Ingiza maoni

source: No comments
sw: Hakuna maoni

source: comments
sw: maoni

source: Error occurred
sw: Hitilafu imetokea

source: No notifications found
sw: Hakuna arifa zilizopatikana

source: All Notifications
sw: Arifa zote

source: Mark all as read
sw: Weka zote kama zimesomwa

source: AI Compare
sw: Linganisha AI

source: View Publication Link
sw: Tazama kiungo cha chapisho

source: View Publication
sw: Tazama chapisho

source: views
sw: mitazamo

source: Unlike
sw: Ondoa kupenda

source: Like
sw: Penda

source: Create Publication
sw: Unda chapisho

source: Step
sw: Hatua

source: Attachments
sw: Viambatisho

source: Target Audience/Communities of Practice
sw: Walengwa/Jamii za utendaji

source: Previous
sw: Iliyotangulia

source: Submit
sw: Wasilisha

source: Select cover photo
sw: Chagua picha ya jalada

source: Your publication is pending approval
sw: Chapisho lako linasubiri idhini

source: Start Here
sw: Anza hapa

source: Member State
sw: Nchi mwanachama

source: Next
sw: Inayofuata

source: Publication Info
sw: Maelezo ya chapisho

source: Add publication info
sw: Ongeza maelezo ya chapisho

source: Resource Categorization
sw: Uainishaji wa rasilimali

source: Resource Type
sw: Aina ya rasilimali

source: Resource Category
sw: Kategoria ya rasilimali

source: Thematic Area
sw: Eneo la kimada

source: Sub Theme
sw: Mada ndogo

# publicationURL
source: Publication URL Link
sw: Kiungo cha URL cha chapisho

source: Select a resource type
sw: Chagua aina ya rasilimali

source: Select a theme
sw: Chagua mandhari

source: Select a sub theme
sw: Chagua mada ndogo

source: Search Publication
sw: Tafuta chapisho

source: Search Forum
sw: Tafuta jukwaa

source: Publications
sw: Machapisho

source: Sub Themes
sw: Mada ndogo

source: Request Content
sw: Omba maudhui

source: Okay
sw: Sawa

source: Confirm
sw: Thibitisha

source: More Themes
sw: Mandhari zaidi

source: Select a public health theme of interest for find resources
sw: Chagua mandhari ya afya ya umma ya maslahi ili kupata rasilimali

source: Please wait...
sw: Tafadhali subiri...

source: No records found
sw: Hakuna rekodi zilizopatikana

source: You are not logged in
sw: Hujaingia

source: Not Logged In
sw: Hujaingia

source: Please login to access more features
sw: Tafadhali ingia ili kupata vipengele zaidi

source: You need to login to view this content
sw: Unahitaji kuingia ili kuona maudhui haya

# pickPublicationOne
source: Pick 1st Publication
sw: Chagua chapisho la 1

# pickPublicationTwo
source: Pick 2nd Publication
sw: Chagua chapisho la 2

source: View Course
sw: Tazama kozi

source: No jobs found
sw: Hakuna ofaa zilizopatikana

source: No countries found
sw: Hakuna nchi zilizopatikana

source: Field required
sw: Kichwa cha kutafuta

source: Invalid phone number
sw: Namba ya simu siwezi
